index.org
#+title: Doom Emacs
#+subtitle: Konfigurasi Instrumen Kiamat Saya.
#+date: 20 November 2022
#+author: Fikri Rahmat Nurhidayat
#+description: Konfigurasi Instrumen Kiamat Saya.
#+language: id

* Prakata

Seperti yang mungkin pembaca sudah ketahui, saya adalah seorang /programmer/. Dan sudah bisa dipastikan, pusaka utama saya adalah /Code Editor/ dimana pusaka ini akan saya gunakan dalam aktifitas menulis kode, mendokumentasikan kode dan sebagainya.

Maka dari itu, saya benar-benar merawat, dan memodifikasi /code editor/ saya menjadi sangat personal dan sangat praktis untuk kebutuhan saya sehari-hari sebagai seorang /programmer/. Singkat cerita, saya akhirnya jatuh cinta dengan emacs karena saya melihat [[https://youtu.be/bEfYm8sAaQg][video dari SystemCrafters]] suatu hari dan terkesima dengan emacs yang secara konsep sederhana, namun tetap bisa terlihat elegan.

Dan juga pada saat itu saya memerlukan alat untuk membantu saya dalam melakukan manajemen pekerjaan-pekerjaan saya yang masih semrawut pada saat itu. Disitulah saya juga menemukan emacs, karena emacs mempunyai fitur bernama =org-mode=, yang mana sangat berguna untuk melakukan manajemen pekerjaan, untuk menulis konten, melakukan literasi pemrograman, dan sebagainya.

Dokumen ini akan selalu saya perbarui apabila ada konfigurasi baru yang saya tambahkan, dan tentu saja, dokumen ini akan menjadi /source code/ dari konfigurasi emacs saya karena saya menggunakan teknik pemrograman bernama /literate programming/.

* Doom Emacs

[[https://github.com/doomemacs/doomemacs/][Doom emacs]] adalah sebuah konfigurasi emacs, atau sebenarnya lebih ke kerangka kerja untuk memodifikasi emacs dengan konfigurasi bawaan yang mumpuni untuk kebutuhan pemrograman pada umumnya.

Kenapa saya menggunakan doom emacs? Karena saya tidak mau repot mengonfigurasi emacs dari awal yang mana banyak sekali hal yang perlu disesuaikan. Dan juga, doom emacs seperti yang sudah disampaikan di muka, adalah sebuah kerangka kerja yang dapat membantu saya mengonfigurasi emacs agar menjadi seperti yang saya bayangkan.

Doom emacs sendiri akan dipasang di dalam direktori =~/.emacs.d=, yang mana direktori itu adalah direktori yang digunakan untuk menyimpan konfigurasi emacs. Kita tidak akan menaruh konfigurasi pribadi kita di dalam direktori itu, melainkan kita akan menaruhnya di dalam direktori =~/.doom.d=.

Konfigurasi pribadi doom emacs ini secara bawaan, terdiri dari 3 berkas, yaitu:
+ =init.el=: Berisi informasi terkait modul doom emacs mana saja yang ingin kita pakai.
+ =config.el=: Konfigurasi pribadi.
+ =packages.el=: Berisi /emacs package/ yang akan dipasang di dalam /emacs/, biasanya yang ditaruh di dalam berkas ini adalah /package/ yang tidak tersedia di dalam modul doom emacs.

Dengan konfigurasi pribadi yang sudah diabstraksi oleh doom emacs, saya akhirnya dapat memodifikasi emacs dengan lebih mudah, dan lebih cepat, tanpa perlu risau terkait performa dan sebagainya.

#+begin_src elisp :tangle init.el :noweb yes
;;; init.el -*- lexical-binding: t; -*-

(doom! :input
       <<doom-input>>

       :completion
       <<doom-completion>>

       :ui
       <<doom-ui>>

       :editor
       <<doom-editor>>

       :emacs
       <<doom-emacs>>

       :term
       <<doom-term>>

       :checkers
       <<doom-checkers>>

       :tools
       <<doom-tools>>

       :os
       <<doom-os>>

       :lang
       <<doom-lang>>

       :email
       <<doom-email>>

       :app
       <<doom-app>>

       :config
       <<doom-config>>)
#+end_src

** Input

Saya tidak tahu ini dipakai untuk apa, dan saya takut jika tidak memasukkan ini akan menyebabkan error.

#+name: doom-input
#+begin_src elisp
;;bidi                 ; (tfel ot) thgir etirw uoy gnipleh
;;chinese
;;japanese
;;layout               ; auie,ctsrnm is the superior home row
#+end_src

** Auto Completion

Sudah sewajarnya seorang /programmer/ menggunakan /auto-completion/ untuk mempercepat proses penulisan kode dan lainnya, karena semakin cepat kita menulis kode, semakin cepat pula kita akan mendapat timbal balik dari apa yang kita tulis. Dan juga, saya tidak ingin menghafal semua kode yang saya tulis, jadi menggunakan /auto-completion/ adalah sebuah keharusan.

Untuk /auto-completion/ sendiri saya menggunakan =company= karena katanya canggih, dan untuk mesin pencarinya sendiri saya menggunakan =vertico= karena katanya yang paling canggih dengan perfoma yang sangat cepat.

#+name: doom-completion
#+begin_src elisp
company                 ; the ultimate code completion backend
(vertico +icons)        ; the search engine of the future
#+end_src

** Antarmuka

Seperti yang saya sebutkan di muka, saya menggunakan emacs karena emacs dapat dimodifikasi sedemikian rupa dengan fungsi-fungsi yang benar-benar canggih namun tetap bisa tampil elegan dari sisi antar muka. Maka dari itu, memodifikasi antar muka supaya emacs terlihat elegan itu begitu penting menurut saya.

Untuk modul-modul antar muka doom emacs yang pantas saya sebutkan disini untuk menunjang keelokan antar muka emacs saya adalah =zen=, karena modul ini akan membantu saya mengonfigurasi =writeroom-mode= yang mana sangat berguna untuk mode menulis.

#+name: doom-ui
#+begin_src elisp
deft                    ; notational velocity for Emacs
doom                    ; what makes DOOM look the way it does
doom-dashboard          ; nifty dashboard
hl-todo                 ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
(ligatures +extra)      ; ligatures and symbols to make your code pretty again
modeline                ; snazzy, Atom-inspired modeline, plus API
ophints                 ; highlight the region an operation acts on
(popup +defaults)       ; tame sudden yet inevitable temporary windows
;;unicode                 ; extended unicode support for various languages
workspaces              ; tab emulation, persistence & separate workspaces
zen                     ; distraction-free coding or writing
#+end_src

** Editor

Modul-modul ini benar-benar menyelamatkan hidup saya. Disini saya memasang /evil/ supaya saya bisa menggunakan /vim keybinding/ karena /modal editing/ benar-benar superior.

#+name: doom-editor
#+begin_src elisp
(evil +everywhere)      ; come to the dark side, we have cookies
file-templates          ; auto-snippets for empty files
fold                    ; (nigh) universal code folding
(format +onsave)        ; automated prettiness
lispy                   ; vim for lisp, for people who don't like vim
snippets                ; my elves. They type so I don't have to
#+end_src

** Emacs

Doom emacs juga menyediakan modul untuk memodifikasi aplikasi-aplikasi bawaan emacs.

#+name: doom-emacs
#+begin_src elisp
dired                   ; making dired pretty [functional]
undo                    ; persistent, smarter undo for your inevitable mistakes
vc                      ; version-control and Emacs, sitting in a tree #+end_src
#+end_src

** Terminal

Tentu saja, agar pemrograman dapat berjalan efektif, saya perlu terminal, karena dengan terminal, saya bisa melakukan banyak /scripting/ yang dapat membantu saya dalam melakukan hal-hal yang repetitif yang bisa saya otomasi dengan terminal.

Untuk terminal sendiri, sebenarnya saya sering menggunakan =vterm=, tapi kali ini saya ingin menggunakan =eshell= sebagai terminal utama saya.

#+name: doom-term
#+begin_src elisp
eshell                  ; the elisp shell that works everywhere
#+end_src

** Checkers

Mendeteksi kesalahan sintaks lebih awal sangat membantu proses pemrograman. Karena saya tidak perlu melakukan kompilasi kode terlebih dahulu yang mana proses tersebut membutuhkan waktu. Artinya saya dapat menulis kode jauh lebih cepat tanpa harus mengulangi proses kompilasi berkali-kali.

Doom emacs menggunakan /flycheck/ sepertinya.

#+name: doom-checkers
#+begin_src elisp
syntax                  ; tasing you for every semicolon you forget
#+end_src

** Tools

Banyak sekali /tools/ yang sangat sakti yang sebelumnya tidak pernah terpikirkan oleh saya. Ambil /magit/ sebagai contoh. Saya tidak pernah merasakan betapa mudahnya mengontrol git sebelumnya. Benar-benar /magit/.

#+name: doom-tools
#+begin_src elisp
(eval +overlay)     ; run code, run (also, repls)
gist                ; interacting with github gists
lookup              ; navigate your code and its documentation
lsp                 ; M-x vscode
magit               ; a git porcelain for Emacs
make                ; run make tasks from Emacs
pass                ; password manager for nerds
rgb                 ; creating color strings
tree-sitter         ; syntax and parsing, sitting in a tree...
#+end_src

** OS

Konfigurasi ini hanya placeholder saja, karena tidak terlalu berguna juga untuk saya karena saya tidak menggunakan emacs di MacOS maupun Terminal.

#+name: doom-os
#+begin_src elisp
(:if IS-MAC macos)      ; improve compatibility with macOS
;;tty                  ; improve the terminal Emacs experience
#+end_src

** Bahasa Pemrograman

Karena saya tergolong poligot di dalam bahasa pemrograman, maka dari itu saya mengaktifkan banyak sekali modul terkait bahasa pemrograman di dalam doom emacs.

#+name: doom-lang
#+begin_src elisp
(cc +eglot)               ; C > C++ == 1
clojure                 ; java with a lisp
common-lisp             ; if you've seen one lisp, you've seen them all
data                    ; config/data formats
(dart +flutter +eglot)    ; paint ui and not much else
emacs-lisp              ; drown in parentheses
(go +eglot)               ; the hipster dialect
json                    ; At least it ain't XML
(java +eglot)             ; the poster child for carpal tunnel syndrome
javascript              ; all(hope(abandon(ye(who(enter(here))))))
julia                   ; a better, faster MATLAB
kotlin                  ; a better, slicker Java(Script)
latex                   ; writing papers in Emacs has never been so fun
lua                     ; one-based indices? one-based indices
markdown                ; writing docs for people to ignore
python                  ; beautiful is better than ugly
(org                    ; organize your plain life in plain text
+roam2                  ; whoa a second brain?
+appear                 ; reduce the unnecessary text
+present                ; present like a chad
+babel                  ; babel
+gnuplot                ; gnuplot
+cliplink)              ; nuclear code
racket                  ; a DSL for DSLs
rest                    ; Emacs as a REST client
(ruby +rails)           ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
(rust +eglot)           ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
(scheme +guile)         ; a fully conniving family of lisps
sh                      ; she sells {ba,z,fi}sh shells on the C xor
yaml                    ; JSON, but readable
#+end_src

** Email

Saya menggunakan =mu4e= karena populer saja. Sebenarnya saya tertarik untuk menggunakan yang lain seperti GNUs dan sebagainya, namun =mu4e= ini menarik karena nano-emacs punya konfigurasi terkait ini.

#+name: doom-email
#+begin_src elisp
(:if (executable-find "mu") (mu4e +org +gmail))
#+end_src

** Aplikasi

Ada beberapa aplikasi canggih yang populer di emacs, dan doom emacs sudah mengabstraksinya melalui modul =:app=.

#+name: doom-app
#+begin_src elisp
;;calendar
;;emms
;;everywhere           ; *leave* Emacs!? You must be joking
;;irc                  ; how neckbeards socialize
;;(rss +org)           ; emacs as an RSS reader
;;twitter              ; twitter client https://twitter.com/vnought
#+end_src

** Konfigurasi

Modul ini sangat sederhana, cuma memberi dua opsi modul yang bisa diaktifkan, yaitu =literate= untuk menggunakan /literate configuration/ dan =(default +bindings)= yang mana sejujurnya saya tidak tau fungsinya apa.

#+name: doom-config
#+begin_src elisp
;;literate
(default +bindings)
#+end_src

* Pengaturan Umum

Doom emacs memiliki beberapa variabel bawaan yang ditaruh oleh doom emacs sendiri setelah kita memasangnya. Variabel ini dapat saya sesuaikan dengan kebutuhkan saya.

Seperti biasa, selalu tambahkan /string/ ajaib di baris pertama pada file, supaya performanya lebih cepat.

#+name: config
#+begin_src elisp :tangle ./config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src

** Informasi Pribadi

Saya perlu mengatur informasi pribadi saya ke dalam variabel yang sudah ditentukan oleh doom emacs. Informasi ini berguna untuk beberapa fungsi, seperti /GPG configuration/, /email client/, /file templates/ dan /snippets/.

#+name: personal-information
#+begin_src elisp :tangle ./config.el
(setq user-full-name "Fikri Rahmat Nurhidayat"
      user-mail-address "fikrirnurhidayat@gmail.com")
#+end_src

** Font

Saya suka fon bawaan dari system. Untuk sistem operasi yang pakai adalah Arch Linux, kemungkinan besar fon bawaannya adalah "Noto Sans Mono" dan sebagainya.

#+name: font
#+begin_src elisp :tangle ./config.el
(setq doom-font
      (font-spec :family "Iosevka Fixed" :size 20)

      doom-big-font
      (font-spec :size 32)

      doom-variable-pitch-font
      (font-spec :family "Iosevka Aile" :size 20 :weight 'normal)

      doom-unicode-font
      (font-spec :family "JuliaMono")

      doom-serif-font
      (font-spec :family "Iosevka Etoile" :weight 'normal))
#+end_src

Dan juga saya perlu memodifikasi beberapa simbol yang ditampilkan oleh emacs, karena secara bawaan masih terlihat sedikit aneh bagi mata saya. Kode di bawah ini berfungsi untuk membuat simbol /comment/ dan /keyword/ di dalam emacs ditampilkan dengan huruf miring.

#+name: custom-faces
#+begin_src elisp :tangle ./config.el
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic)
  `(org-indent :inherit fixed-pitch :foreground ,(face-attribute 'default :background)))
#+end_src

** Antarmuka

Di dalam emacs, terdapat banyak konfigurasi terkait antarmuka, seperti /line numbers/, /themes/, /fringe/ dan sebagainya.

*** Line Numbers

Karena berlatarbelakang vim, maka dari itu akan sangat membantu jika saya menggunakan /relative line numbers/ dalam menggunakan editor ini.

#+name: emacs-line-numbers
#+begin_src elisp :tangle ./config.el
(setq display-line-numbers-type 'relative)
#+end_src

*** Theme

Karena sistem saya mayoritas menggunakan [[https://www.nordtheme.com/][nord]], sudah semestinya emacs saya juga mengikuti. Untungnya doom emacs datang dengan tema-tema kostum dari doom emacs sendiri.

#+name: emacs-theme
#+begin_src elisp :tangle ./config.el
(setq doom-theme 'doom-nord-aurora)
#+end_src

