index.org
*** Window

Saya adalah seseorang yang tidak terlalu suka melihat sesuatu yang tidak begitu berguna di mata saya seperti /border/ untuk /window/ di dalam emacs.

Dan juga, di dalam emacs, ada yang namanya fringe, yang mana adalah sebuah teks yang ditampilkan apabila ada baris yang terlalu panjang yang tidak bisa ditampilkan kalau /cursor/-nya tidak digeser. Ini menurut saya sangat mengganggu karena di dalam /vim/ saya tidak menemukannya.

#+name: emacs-window
#+begin_src elisp :tangle ./config.el
(defun +doom-remove-annoying-visual ()
  "Remove border, fringe, and so on."
  (dolist (face '(window-divider
                  window-divider-first-pixel
                  window-divider-last-pixel
                  fringe))
    (custom-set-faces! `(,face :foreground ,(face-attribute 'default :background)))))

;; TODO: Find what hook should we attach so this will always be properly executed
(add-to-list 'doom-load-theme-hook '+doom-remove-annoying-visual)
#+end_src

*** Echo Area

Dan juga, karena saya begitu mudah terdistraksi dengan pesan yang muncul di dalam /echo area/, maka dari itu lebih baik saya bisukan saja.

#+name: emacs-echo-area
#+begin_src elisp :tangle ./config.el
(setq inhibit-message t
      echo-keystores nil
      message-log-max 100)
#+end_src

*** Modeline

Karena saya menggunakan doom, tentu saja saya akan menggunakan /doom modeline/ secara bawaan. Namun ada beberapa hal yang perlu saya sesuaikan, mulai dari ukuran /modeline/-nya dan sebagainya.

#+begin_src elisp :tangle ./config.el
(use-package! doom-modeline
  :config
  (setq doom-modeline-hud nil
        doom-modeline-icon t
        doom-modeline-window-width-limit nil
        doom-modeline-major-mode-icon t
        doom-modeline-number-limit 99
        doom-modeline-lsp nil))
#+end_src

Dan juga saya tidak terlalu senang apabila modeline diberi warna latar belakang, jadi saya samakan saja dengan latar belakang emacs saya.

#+begin_src elisp :tangle ./config.el
(after! doom (custom-set-faces!
               `(mode-line :background ,(face-attribute 'default :background))
               `(mode-line-inactive :background ,(face-attribute 'default :background))
               `(doom-modeline-bar :background ,(face-attribute 'default :background))
               `(doom-modeline-bar-inactive :background ,(face-attribute 'default :background))))
#+end_src

*** Lainnya

Karena emacs itu isinya cuma emacs lisp saja mayoritas, maka menginstal =rainbow-mode= itu sangatlah berguna untuk memodifikasi kode lisp.

#+begin_src elisp :tangle ./packages.el
(package! rainbow-mode)
#+end_src

Dan juga, karena saya tidak suka kalau scratch buffer tidak menggunakan background yang sama, maka saya mematikan =solaire-mode=.

#+begin_src elisp :tangle ./packages.el
(package! solaire-mode :disable t)
#+end_src

** Pengaturan Sederhana

Doom emacs punya banyak pengaturan bawaan yang canggih-canggih, saya cuma perlu melengkapinya saja.

#+begin_src elisp :tangle ./config.el
(setq evil-want-fine-undo t         ; Be more granular
      auto-save-default t           ; Make sure your work is saved
      truncate-string-ellipsis "…") ; Save some precious space
#+end_src

* Email

Saya menggunakan mu4e kebutuhan email saya. Untuk melakukan konfigurasi mu4e, saya hanya perlu menspesifikasikan beberapa variabel ke dalam emacs saya.

#+begin_src elisp :tangle ./config.el
(setq mu4e-view-prefer-html nil
      mu4e-html2text-command "html2text -utf8 -width 72")
(with-eval-after-load "mm-decode"
  (add-to-list 'mm-discouraged-alternatives "text/html")
  (add-to-list 'mm-discouraged-alternatives "text/richtext"))
#+end_src

* Splash Screen

Splash Screen adalah /fallback buffer/ dari doom emacs. Saya ingin memodifikasinya sehingga terlihat menarik. Modifikasi ini saya curi dari Tecosaur.

#+begin_src elisp :tangle ./lisp/splash/splash.el
;;; $DOOMDIR/lisp/splash/splash.el -*- lexical-binding: t; -*-

(defvar fancy-splash-image-template
  (expand-file-name "misc/splash-images/emacs-e-template.svg" doom-private-dir)
  "Default template svg used for the splash image, with substitutions from ")

(defvar fancy-splash-sizes
  `((:height 300 :min-height 50 :padding (0 . 2))
    (:height 250 :min-height 42 :padding (2 . 4))
    (:height 200 :min-height 35 :padding (3 . 3))
    (:height 150 :min-height 28 :padding (3 . 3))
    (:height 100 :min-height 20 :padding (2 . 2))
    (:height 75  :min-height 15 :padding (2 . 1))
    (:height 50  :min-height 10 :padding (1 . 0))
    (:height 1   :min-height 0  :padding (0 . 0)))
  "list of plists with the following properties
  :height the height of the image
  :min-height minimum `frame-height' for image
  :padding `+doom-dashboard-banner-padding' (top . bottom) to apply
  :template non-default template file
  :file file to use instead of template")

(defvar fancy-splash-template-colours
  '(("$colour1" . keywords) ("$colour2" . type) ("$colour3" . base5) ("$colour4" . base8))
  "list of colour-replacement alists of the form (\"$placeholder\" . 'theme-colour) which applied the template")

(unless (file-exists-p (expand-file-name "theme-splashes" doom-cache-dir))
  (make-directory (expand-file-name "theme-splashes" doom-cache-dir) t))

(defun fancy-splash-filename (theme-name height)
  (expand-file-name (concat (file-name-as-directory "theme-splashes")
                            theme-name
                            "-" (number-to-string height) ".svg")
                    doom-cache-dir))

(defun fancy-splash-clear-cache ()
  "Delete all cached fancy splash images"
  (interactive)
  (delete-directory (expand-file-name "theme-splashes" doom-cache-dir) t)
  (message "Cache cleared!"))

(defun fancy-splash-generate-image (template height)
  "Read TEMPLATE and create an image if HEIGHT with colour substitutions as
   described by `fancy-splash-template-colours' for the current theme"
  (with-temp-buffer
    (insert-file-contents template)
    (re-search-forward "$height" nil t)
    (replace-match (number-to-string height) nil nil)
    (dolist (substitution fancy-splash-template-colours)
      (goto-char (point-min))
      (while (re-search-forward (car substitution) nil t)
        (replace-match (doom-color (cdr substitution)) nil nil)))
    (write-region nil nil
                  (fancy-splash-filename (symbol-name doom-theme) height) nil nil)))

(defun fancy-splash-generate-images ()
  "Perform `fancy-splash-generate-image' in bulk"
  (dolist (size fancy-splash-sizes)
    (unless (plist-get size :file)
      (fancy-splash-generate-image (or (plist-get size :template)
                                       fancy-splash-image-template)
                                   (plist-get size :height)))))

(defun ensure-theme-splash-images-exist (&optional height)
  (unless (file-exists-p (fancy-splash-filename
                          (symbol-name doom-theme)
                          (or height
                              (plist-get (car fancy-splash-sizes) :height))))
    (fancy-splash-generate-images)))

(defun get-appropriate-splash ()
  (let ((height (frame-height)))
    (cl-some (lambda (size) (when (>= height (plist-get size :min-height)) size))
             fancy-splash-sizes)))

(setq fancy-splash-last-size nil)
(setq fancy-splash-last-theme nil)
(defun set-appropriate-splash (&rest _)
  (let ((appropriate-image (get-appropriate-splash)))
    (unless (and (equal appropriate-image fancy-splash-last-size)
                 (equal doom-theme fancy-splash-last-theme)))
    (unless (plist-get appropriate-image :file)
      (ensure-theme-splash-images-exist (plist-get appropriate-image :height)))
    (setq fancy-splash-image
          (or (plist-get appropriate-image :file)
              (fancy-splash-filename (symbol-name doom-theme) (plist-get appropriate-image :height))))
    (setq +doom-dashboard-banner-padding (plist-get appropriate-image :padding))
    (setq fancy-splash-last-size appropriate-image)
    (setq fancy-splash-last-theme doom-theme)
    (+doom-dashboard-reload)))

(add-hook 'window-size-change-functions #'set-appropriate-splash)
(add-hook 'doom-load-theme-hook #'set-appropriate-splash)
#+end_src

Dan juga, sepertinya one liner sentence itu menarik juga untuk ditambahkan.

#+begin_src elisp :tangle ./lisp/splash/splash.el
(defun +doom-dashboard-remove-annoying-visual ()
  "Hide cursor and modeline"
  (hide-mode-line-mode 1)
  (hl-line-mode -1)
  (setq-local evil-normal-state-cursor (list nil)))

(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-footer)
(add-hook '+doom-dashboard-functions #'+doom-dashboard-remove-annoying-visual)
#+end_src

Lalu tentu saja, saya perlu memuat file tersebut ke dalam =config.el=

#+begin_src elisp :tangle ./config.el
(load-file (concat doom-user-dir "lisp/splash/splash.el"))
#+end_src

* Pencatatan

Untuk pencatatan sendiri saya menggunakan =deft=. Tidak tahu kenapa, tapi saya baru mencobanya saat ini.

#+begin_src elisp :tangle ./config.el
(use-package! deft
  :init
  (setq deft-directory "/home/fain/Documents/notes/"
        deft-recursive t
        deft-file-naming-rules '((noslash . "-") (nospace . "-") (case-fn . downcase))
        deft-strip-title-regexp "\\(?:^%+\\|^#\\+title: *\\|^[#* ]+\\|-\\*-[[:alpha:]]+-\\*-\\|^Title:[	 ]*\\|#+$\\)"
        deft-open-file-hook '+deft-open-file-hook))
#+end_src

** Mode Pencatatan

Saya tidak terlalu suka juga dengan tampilan bawaan ketika saya membuka catatan. Catatan seharusnya terlihat sederhana dan tidak terlalu ribet, jadi saya membuat mode baru.

#+begin_src elisp :tangle ./lisp/org/org-note.el
;;; org/org-note.el --- Make org more like note -*- lexical-binding: t; -*-
(require 'org)
(require 'mixed-pitch)
(require 'visual-fill-column)

(define-minor-mode org-note-mode
  "Toggle org-note-mode and display org mode as note."
  :lighter "org-note"
  (if org-note-mode
      (progn
        (setq-local visual-fill-column-width 96
                    visual-fill-column-center-text t)
        (pushnew! mixed-pitch-fixed-pitch-faces
            'solaire-line-number-face
            'org-document-info
            'org-date
            'org-footnote
            'org-special-keyword
            'org-property-value
            'org-ref-cite-face
            'org-tag
            'org-todo-keyword-todo
            'org-todo-keyword-habt
            'org-todo-keyword-done
            'org-todo-keyword-wait
            'org-todo-keyword-kill
            'org-todo-keyword-outd
            'org-todo
            'org-done
            'font-lock-comment-face)
        (visual-fill-column-mode 1)
        (mixed-pitch-mode 1))
    (progn
      (setq-local visual-fill-column-width nil)
      (mixed-pitch-mode 0)
      (visual-fill-column-mode 0))))

(provide 'org-note)
#+end_src


Lalu, muat file tersebut ketika membuka doom emacs.

#+begin_src elisp :tangle ./config.el
(load-file (concat doom-user-dir "lisp/org/org-note.el"))
#+end_src

Terakhir, saya perlu menambahkan /keybinding/ untuk mengaktifkan mode pencatatan.

#+begin_src elisp :tangle ./config.el
(map! :leader :desc "Present" "t n" #'org-note-mode)
#+end_src

** Otomatis Mengaktifkan Mode Pencatatan

Mode tersebut akan diaktifkan ketika kita membuka catatan melalui deft.

#+begin_src elisp :tangle ./config.el
(defun +deft-open-file-hook ()
  (when (eq major-mode 'org-mode)
    (org-note-mode 1)))
#+end_src

* Org Mode

Org adalah sebuah mode di dalam emacs yang berfungsi untuk menerapkan /"Carsten's outline-mode for keeping track of everything."/. Di dalam emacs, banyak sekali fitur yang dapat digunakan ketika kita menggunakan =org-mode=. Salah satunya adalah manajemen tugas. Namun pada bagian ini saya hanya akan berfokus kepada kegunaan emacs dalam proses menulis saja.

** /File/ dan Direktori

Saya bisa memberi tahu emacs, dimana saya akan menyimpan file org saya di dalam komputer saya. Ini sebenarnya tidak terlalu penting, karena pada umumnya, saya hanya perlu memspesifikasikan lokasi file di dalam konfigurasi fitur org yang akan saya gunakan, seperti org agenda, dan org roam.

#+begin_src elisp :tangle ./config.el
(setq org-directory "/home/fain/Documents/org/")
#+end_src

