index.org
** Pomodoro

Saya mudah terdistraksi hal-hal sederhana, seperti notifikasi /handphone/, dan sebagainya. Ada satu teknik yang digunakan di luar sana untuk memaksa kita fokus dalam waktu 25 menit, teknik ini bernama pomodoro.

Di dalam emacs, saya dapat menggunakan fitur pomodoro ini dengan memanggil fungsi =org-timer-set-timer=, yang mana kita akan ditanya terkait durasi dari /timer/ tersebut. Setelah /timer/ itu habis, emacs akan memutar suara yang saya tentukan sebagai notifikasi bahwa waktu sudah habis, seperti jam pomodoro pada umumnya.

#+begin_src elisp :tangle ./config.el
(setq org-clock-sound "/home/fain/Documents/bababooey.wav")
#+end_src

** Kenyamanan

Kode dibawah ini berguna untuk mengatur /behaviour/ dari /org mode/ itu sendiri secara global. Saya malas mendokumentasikannya satu per satu, jadi sebaiknya dilihat langsung saja satu per satu menggunakan =SPC h v=.

#+begin_src elisp :tangle ./config.el
(setq org-use-property-inheritance t
      org-log-done 'time
      org-startup-indented t
      org-adapt-indentation nil
      org-indent-mode-turns-off-org-adapt-indentation t
      org-hide-leading-stars t
      org-list-allow-alphabetical t
      org-export-in-background t
      org-fold-catch-invisible-edits 'smart)
#+end_src

** Tampilan

Menurut saya, dengan tampilan minimalis dan tetap elegan di dalam /org mode/, akan membantu saya untuk tetap fokus melakukan apapun yang saya lakukan di dalam /org mode/. Mayoritas aktifitas saya di dalam /org mode/ adalah menulis.

*** Sembunyikan /Line Number/

Karena org mode ini dipakai untuk menulis, menurut saya informasi /line numbers/ ini sangat tidak berguna. Jadi lebih baik kita sembunyikan saja.

#+begin_src elisp :tangle ./config.el
(add-hook 'org-mode-hook (lambda () (display-line-numbers-mode 0)))
#+end_src

*** Tampilan Modern

Untuk tampilan sendiri, saya menggunakan [[https://github.com/minad/org-modern][Modern Org Style]].

#+name: package-org-modern
#+begin_src elisp :tangle ./packages.el
(package! org-modern)
#+end_src

Dan juga, karena tulisan saya punya tajuk yang semakin menjorok ke dalam, maka dari itu saya perlu modifikasi =org-modern-star=.

#+begin_src elisp :tangle ./config.el
(use-package! org-modern
  :custom
  (org-modern-star '("•"))
  (org-modern-list '((43 . "◦") (45 . "•") (42 . "•")))
  (org-modern-hide-stars " ")
  (org-modern-keyword '(("title"       . "title:       ")
                        ("description" . "description: ")
                        ("subtitle"    . "subtitle:    ")
                        ("date"        . "date:        ")
                        ("author"      . "author:      ")
                        ("language"    . "language:    ")
                        (t . t)))
  (org-modern-block-fringe nil)
  :config
  (global-org-modern-mode))
#+end_src

*** Emphasis Tidak Terlihat

Saya bisa menambahkan *bold*, /italic/, +strike-through+, dan sebagainya. Secara bawaan, ketika emacs menampilkan file org, di bagian emphasis, emacs akan menampilkan bungkus dari emphasis itu, sebagai contoh =*bold*=. Tampilan seperti itu mengganggu konsentrasi saya, karena terlalu banyak informasi yang ditampilkan secara literal, maka dari itu sebaiknya disembunyikan saja.

#+begin_src elisp :tangle ./config.el
(setq org-hide-emphasis-markers t)
#+end_src

Namun, konfigurasi itu membuat masalah baru, yaitu karakter pembungkus emphasis sama sekali tidak terlihat dan menyebabkan pengeditan bermasalah. Untungnya ada paket di luar sana yang menyelesaikan masalah ini, yaitu =org-appear=.

#+name: package-org-appear
#+begin_src elisp :tangle ./packages.el
(package! org-appear)
#+end_src

Saya juga ingin =org-appear= dinyalakan setiap kali saya membuka file org.

#+name: config-org-appear
#+begin_src elisp :tangle ./config.el
(use-package! org-appear
  :hook (org-mode . org-appear-mode)
  :config
  (setq org-appear-autoemphasis t
        org-appear-autosubmarkers t
        org-appear-autolinks nil)
  ;; for proper first-time setup, `org-appear--set-elements'
  ;; needs to be run after other hooks have acted.
  (run-at-time nil nil #'org-appear--set-elements))
#+end_src

*** Font

Secara bawaan, ketika saya mengaktifkan =org-indent-mode= secara tampilan akan rusak. Terlebih lagi ketika saya menulis =org-block= yang mana ketika kode-nya melebihi batas maksimal baris, kodenya akan terpotong dan langsung terindentasi.

Untuk menghindari hal-hal seperti itu, saya merubah tampilan dari beberapa /font lock/ yang terdapat pada org mode.

#+begin_src elisp :tangle ./config.el
(custom-set-faces!
  `(org-block :inherit org-block :background ,(face-attribute 'default :background))
  `(org-block-begin-line :inherit shadow :height 0.8)
  `(org-document-info :inherit doom-font))
#+end_src

*** Lainnya

Disini saya memodifikasi elipsis dan menyuruh emacs untuk menampilkan entitas dengan gaya.

#+begin_src elisp :tangle ./config.el
(setq org-pretty-entities t
      org-ellipsis "…")
#+end_src

** Agenda

Saya juga menggunakan =org-agenda= untuk mengatur agenda saya setiap hari. Org agenda ini saya pakai untuk mengimplementasikan GTD yang dicetuskan oleh David Allen.

Pertama-tama, saya harus memberi tahu emacs dimana saya meletakkan file agenda saya. Pada dasarnya akan ada 3 file yang akan menjadi file agenda, yaitu:
+ =PROJECTS.org=
+ =NEXT.org=
+ =MAYBE.org=

Kode dibawah ini saya gunakan untuk mengatur variabel =+org-agenda-directory= dan =org-agenda-files=:

#+begin_src elisp :tangle ./config.el
(setq +org-agenda-directory (concat org-directory "agenda/"))
(setq org-agenda-files (mapcar (lambda (file)
                                 (concat +org-agenda-directory file))
                               '("INBOX.org" "PROJECTS.org" "NEXT.org" "MAYBE.org")))
#+end_src

*** Membuka File Agenda Secara Otomatis

#+begin_src elisp :tangle ./config.el
(defun +org-agenda-finalize-hook ()
  "Load org agenda files and hide modeline."
  (hide-mode-line-mode 1)
  (dolist (file org-agenda-files)
    (find-file-noselect file)))

(add-hook 'org-agenda-finalize-hook #'+org-agenda-finalize-hook)
#+end_src

*** Kata Kunci Status Pekerjaan

Org agenda tidak akan berguna kalau tidak saya gunakan untuk melacak status dari sebuah pekerjaan. Untuk melacak status dari pekerjaan, intinya saya butuh 4 status, yaitu:
+ TODO: Sesuatu yang harus saya klarifikasi dan kerjakan.
+ WAIT: Sesuatu yang saya delegasikan ke orang lain.
+ HOLD: Sesuatu yang ditunda.
+ NEXT: Sesuatu yang harus saya segera lakukan ketika saya bisa.
+ VOID: Sesuatu yang dibatalkan.
+ DONE: Sesuatu yang sudah selesai.

Kode di bawah ini berfungsi untuk mengatur kata kunci tersebut ke dalam agenda saya:

#+begin_src elisp :tangle ./config.el
(setq org-todo-keywords '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
                          (sequence "WAIT(w@/!)" "HOLD(h@/!)" "|" "VOID(c@/!)")))
#+end_src

*** Refile

Ketika saya mencatat semua hal yang perlu saya lakukan, tentu saja akan ada masa ketika saya harus mengklarifikasinya. Ketika saya klarifikasi agenda-agenda saya, saya perlu memindahkannya ke tempat yang layak. Sebagai contoh, ketika sesuatu yang harus saya lakukan ini adalah bagian dari sebuah proyek, maka agenda tersebut harus dipindahkan ke file =PROJECTS.org= sesuai dengan proyeknya.

#+begin_src elisp :tangle ./config.el
(setq org-refile-targets '(("PROJECTS.org" :maxlevel . 3)
                             ("MAYBE.org" :level . 1)
                             ("NEXT.org" :maxlevel . 2)))

(advice-add 'org-refile :after 'org-save-all-org-buffers)
#+end_src

*** Capture Template

Saya perlu cara yang efektif untuk mencatat agenda-agenda saya yang datang baik itu melalui email, pesan di slack, dan sumber lainnya. Saya bisa menambahkan templat untuk mencatat informasi-informasi tersebut. Hal yang perlu saya lakukan adalah mengatur variabel =org-capture-templates=.

#+begin_src elisp :noweb yes :tangle ./config.el
(setq org-capture-templates '(<<inbox-capture-template>>
                              <<website-capture-template>>))
#+end_src

**** Inbox

Kotak masuk yang saya maksud disini adalah implementasi /Inbox/ yang didefinisikan di dalam GTD.

#+name: inbox-capture-template
#+begin_src elisp
("i" "Inbox" entry (file "~/Documents/org/agenda/INBOX.org") "* TODO %i%?")
#+end_src

**** Website

Terkadang saya ingin menandai sebuah situs di internet yang akan saya buka kalau saya ada waktu, atau saya kunjungi lagi ketika saya membutuhkan informasi di situs itu lagi.

#+name: website-capture-template
#+begin_src elisp
("w" "Website" entry (file "~/Documents/org/agenda/INBOX.org")
                               "* TODO [[%:link][%:description]]\n\n %i" :immediate-finish t)
#+end_src

*** Tampilan

Secara bawaan, tampilan dari org agenda itu sangat sederhana. Saya mengambil /snippets/ ini dari dokumentasi =org-modern=, dan sejujurnya belum mencoba efeknya seperti apa.

#+begin_src elisp :tangle ./config.el
(setq org-agenda-tags-column 0
      org-agenda-block-separator ?─
      org-agenda-time-grid
      '((daily today require-timed)
        (800 1000 1200 1400 1600 1800 2000)
        " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
      org-agenda-current-time-string
      "⭠ now ─────────────────────────────────────────────────")
#+end_src

Kode di bawah ini saya contek dari [[https://blog.jethro.dev/posts/org_mode_workflow_preview/][tulisannya Jethro Kuan]], yang mana berfungsi untuk menentukan bagaimana agenda itu ditampilkan di dalam =org-agenda-view=.

#+name: org-agenda-view
#+begin_src elisp :noweb yes :tangle ./config.el
(setq org-agenda-custom-commands
      '(("o" "Agenda"
         (
          <<org-agenda-to-refile-section>>
          <<org-agenda-in-progress-section>>
          <<org-agenda-projects-section>>
          <<org-agenda-one-off-tasks-section>>
          )
          nil)))
#+end_src

**** To Refile

Bagian ini berfungsi untuk menampung semua kotak masuk.

#+name: org-agenda-to-refile-section
#+begin_src elisp
(todo "TODO"
      ((org-agenda-overriding-header "To Refile")
       (org-agenda-files '("~/Documents/org/agenda/INBOX.org"))))
#+end_src

**** In Progress

Bagian ini berfungsi untuk menampung semua item yang sedang dikerjakan/dilakukan.

#+name: org-agenda-in-progress-section
#+begin_src elisp
(todo "NEXT"
      ((org-agenda-overriding-header "In Progress")
       (org-agenda-files '("~/Documents/org/agenda/PROJECTS.org"
                           "~/Documents/org/agenda/MAYBE.org"
                           "~/Documents/org/agenda/NEXT.org"))))
#+end_src

**** Projects

Bagian ini berfungsi untuk menampung semua item yang di dalam sebuah proyek.

#+name: org-agenda-projects-section
#+begin_src elisp
(todo "TODO"
      ((org-agenda-overriding-header "Projects")
       (org-agenda-files '("~/Documents/org/agenda/PROJECTS.org"))))
#+end_src

**** One-off Tasks

Bagian ini berfungsi untuk menampung semua item yang di dalam sebuah proyek.

#+name: org-agenda-one-off-tasks-section
#+begin_src elisp
(todo "TODO"
      ((org-agenda-overriding-header "One-off Tasks")
       (org-agenda-files '("~/Documents/org/agenda/NEXT.org"))
       (org-agenda-skip-function '(org-agenda-skip-entry-if 'deadline 'scheduled))))
#+end_src

