index.org
** Tulisan

Seperti yang sudah saya sebutkan di muka, saya menggunakan org mode untuk menulis. Baik itu artikel, jurnal, bahkan konfigurasi emacs saya.

Agar proses penulisan lebih menyenangkan, saya menggunakan modul =zen= dari doom emacs. Yang mana di dalam modul tersebut, doom emacs menggunakan =writeroom-mode=.

Saya mencuri kode ini dari [[https://tecosaur.github.io/emacs-config/config.html][tecosaur]], yang mana disitu dia menambahkan hook ketika mengaktifkan writeroom dan menonaktifkannya.

#+begin_src elisp :tangle ./config.el
(after! writeroom-mode
  (pushnew! writeroom--local-variables
            'display-line-numbers
            'visual-fill-column-width)
  (add-hook 'writeroom-mode-enable-hook #'+zen-prose-org-h))
  (add-hook 'writeroom-mode-disable-hook #'+zen-nonprose-org-h)
#+end_src

*** Ukuran Teks

Selain itu, ketika saya mengaktifkan =writeroom-mode=, saya ingin teks yang ditampilkan lebih besar dari biasanya. Maka dari itu, saya menambahkan variabel baru yang berfungsi untuk mendefinisikan teks yang ditampilkan nanti akan diperbesar berapa kali.

#+begin_src elisp :tangle ./config.el
(defvar +zen-org-level-scale '((org-level-1 . 1.5)
                               (org-level-2 . 1.25)
                               (org-level-3 . 1.125)
                               (org-level-4 . 1.0)
                               (org-level-5 . 1.0)
                               (org-level-6 . 1.0)
                               (org-level-7 . 1.0)
                               (org-level-8 . 1.0))
  "Org level size remap.")
#+end_src

*** Prosa

Saya tidak tahu kenapa tecosaur menyebutnya sebagai /prose/, tapi masuk akal juga kalo dinamakan prosa karena ini tentang keindahan.

#+begin_src elisp :tangle ./config.el
(defun +zen-prose-org-h ()
  "Reformat the current Org buffer appearance for prose."
  (when (eq major-mode 'org-mode)
    (setq-local visual-fill-column-width 48
                org-adapt-indentation nil
                org-modern-hide-stars t
                +zen-text-scale 1.0)
    (org-modern-mode 0)
    (org-indent-mode 0)
    (org-modern-mode 1)
    (setq-local face-remapping-alist (mapcar (lambda (face) `(,(car face) (:height ,(cdr face))  ,(car face))) +zen-org-level-scale))))
#+end_src

*** Nonprosa

Disini saya membuat fungsi yang mana adalah anti dari apa yang ktia lakukan di prosa tadi.

#+begin_src elisp :tangle ./config.el
(defun +zen-nonprose-org-h ()
  "Reverse the effect of `+zen-prose-org'."
  (when (eq major-mode 'org-mode)
    (setq-local org-adapt-indentation nil
          org-modern-hide-stars " ")
    (org-modern-mode 0)
    (org-indent-mode 1)
    (org-modern-mode 1)
    (setq-local face-remapping-alist nil)))
#+end_src

** Presentasi

Saya juga menggunakan emacs untuk presentasi apabila saya perlu mempresentasikannya di suatu rapat yang saya hadiri. Menggunakan emacs untuk presentasi ini sangat praktikal bagi saya. Karena saya menggunakan emacs untuk menuangkan ide-ide saya, dan ketika saya perlu mempresentasikan ide tersebut, saya tinggal buat struktur layaknya presentasi di dalam emacs juga.

#+begin_src elisp :tangle ./packages.el
(package! org-present)
#+end_src

Untuk konfigurasi presentasi sendiri saya menyontek dari [[https://youtu.be/SCPoF1PTZpI][video SystemCrafters]].

#+begin_src elisp :tangle ./config.el
(use-package! org-present
  :hook ((org-present-mode . +org-present-hook)
         (org-present-mode-quit . +org-present-quit-hook))
  :init
  (map! :leader :desc "Present" "t p" #'org-present-mode)
  (add-hook 'org-present-after-navigate-functions '+org-present-prepare-slide))
#+end_src

*** Prosedur Pengaktifan

Ketika mode presentasi dinyalakan pada file org, saya melakukan beberapa penyesuaian sebelum akhirnya presentasi ini ditampilkan. Maka dari itu saya perlu menambahkan /hook/ ketika =org-present-mode= dipanggil.

Saya perlu merubah ukuran teksnya juga.

#+begin_src elisp :tangle ./config.el
(defvar +org-present-org-level-scale '((org-level-1 . 2.5)
                                       (org-level-2 . 2.0)
                                       (org-level-3 . 1.75)
                                       (org-level-4 . 1.5)
                                       (org-level-5 . 1.25)
                                       (org-level-6 . 1.0)
                                       (org-level-7 . 1.0)
                                       (org-level-8 . 1.0))
  "Org level size remap for presentation.")
#+end_src

Masih ada beberapa hal yang perlu saya sesuaikan disini, sebagai contoh, saya perlu mendeteksi apakah saat ini dokumen yang saya buka ini sedang ditampilkan dalam mode penulisan atau tidak, dan sebagainya.

#+begin_src elisp :tangle ./config.el
;; TODO: Save previous org-indent-mode
;;       Also for the org-modern-mode
(defun +org-present-hook ()
  (org-modern-mode 0)
  (org-indent-mode 0)
  (setq-local visual-fill-column-width 96
              visual-fill-column-center-text t
              org-modern-hide-stars t
              header-line-format " ")
  (setq-local face-remapping-alist (append (mapcar (lambda (face) `(,(car face) (:height ,(cdr face))  ,(car face))) +org-present-org-level-scale)
                                           '((default (:height 1.5) default)
                                             (header-line (:height 4.0) header-line)
                                             (org-document-title (:height 2.0) org-document-title)
                                             (org-document-info (:height 1.5) org-document-info))))
  (display-line-numbers-mode 0)
  (visual-fill-column-mode 1)
  (visual-line-mode 1)
  (hide-mode-line-mode 1)
  (org-modern-mode 1)
  (mixed-pitch-mode 1)
  (org-display-inline-images))
#+end_src

*** Prosedur Penonaktifan

Sama seperti mode penulisan tadi, ketika saya menonaktifkan mode presentasi, saya perlu mengembalikan apa saja yang saya rubah ketika mengaktifkan mode presentasi ke bentuk aslinya.

#+begin_src elisp :tangle ./config.el
;; TODO: Restore original org-indent-mode value
;;       Restore org-modern-hide-stars value
(defun +org-present-quit-hook ()
  (setq-local header-line-format nil
              face-remapping-alist nil
              org-adapt-indentation nil
              org-modern-hide-stars " ")
  (org-present-small)
  (visual-fill-column-mode 0)
  (org-indent-mode 1)
  (hide-mode-line-mode 0)
  (mixed-pitch-mode 0)
  (org-mode-restart)
  (org-remove-inline-images))
#+end_src

*** Prosedur Perpindahan /Slide/

Setiap kali saya melakukan perpindahan slide di dalam /org present/, /org present/ akan selalu mengatur ulang tampilan /slide/ menggunakan konfigurasi bawaannya. Karena gaya saya dalam menampilkan /slide/ selalu sama, dan kebetulan berbeda dengan bawaannya /org present/, maka dari itu saya perlu menambahkan fungsi yang akan selalu dieskekusi ketika saya memindah slide di dalam /org present/.

#+begin_src elisp :tangle ./config.el
(defun +org-present-prepare-slide (buffer-name heading)
  (org-overview)
  (org-fold-show-entry)
  (org-fold-show-children))
#+end_src

** Roam

Roam adalah sebuah aplikasi yang mengimplementasikan metode Zettelkasten. Karena Roam ini mahal, maka seorang mahasiswa dari Universitas Nasional Singapura membuat /package/ yang mengimplementasikan fitur-fitur dari Roam ke dalam emacs. Mahasiswa tersebut bernama [[https://www.jethro.dev/][Jethro Kuan]].

Saya sendiri tertarik untuk menggunakan /package/ ini, karena menurut saya, /package/ ini akan sangat membantu saya dalam menuangkan ide-ide, atau informasi yang saya dapatkan dari berbagai sumber. Dan juga, saya sangat tertarik untuk mengimplementasikan metode Zettelkasten di dalam hidup saya.

Untuk konfigurasi terkait Org Roam sendiri tidak terlalu rumit, saya hanya perlu menambahkan deklarasi /use package/ dan menambahkan =org-roam= sebagai dependensi di dalam emacs saya.

Oh iya, saya menggunakan =org-roam-ui= untuk memvisualisasikan catatan-catatan saya di dalam /slip-box/ saya. Dan instalasi di bawah ini saya ambil langsung dari dokumentasi [[https://github.com/org-roam/org-roam-ui#doom][org-roam-ui]].

#+begin_src elisp :tangle ./packages.el
(unpin! org-roam)
(package! org-roam-ui)
#+end_src

*** Konfigurasi Org Roam

Yang perlu saya konfigurasi di dalam org roam hanya beberapa variabel saja, karena sejujurnya fitur dari /package/ ini sudah sangat memadai untuk kebutuhan saya. Variabel yang perlu sesuaikan hanyalah variabel yang menentukan dimana org roam harus meletakkan, dan mencari file-file saya terkait org roam, yang biasa disebut sebagai /slip-box/. Di dalam konfigurasi ini juga, saya perlu mendeklarasikan bahwa saya menggunakan [[https://blog.jethro.dev/posts/org_roam_v2/][org roam versi 2]].

#+begin_src elisp :tangle ./config.el
(use-package! org-roam
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory (concat org-directory "roams/"))
  (org-roam-capture-templates
   '(("d" "Default" plain
      "%?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)))
  (org-roam-complete-everywhere t))
#+end_src

*** Konfigurasi Org Roam UI

Seperti yang sudah saya sebut di muka tadi, org roam ui ini berfungsi untuk memvisualisasi catatan-catatan yang ada di dalam /slip-box/ saya.

#+begin_src elisp :tangle ./config.el
(use-package! websocket
  :after org-roam)

(use-package! org-roam-ui
    :after org-roam
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src

** Blog

Tujuan saya menggunakan org salah satunya adalah mulai membuat blog. Untuk itu, saya membuat fungsi untuk membuat file blog secara otomatis.

#+begin_src elisp :tangle ./config.el
(defvar create-blog-post--replace-alist '(" " "'")
  "Cons of replace str")

(defvar create-blog-post--directory "~/Repositories/fikrirnurhidayat/content/id/"
  "Where to store blog files.")

(defun create-blog-post--slugify (title)
  (downcase (string-replace " " "-" title)))

(defun create-blog-post ()
  "Create an org file in ~/source/myblog/posts."
  (interactive)
  (let* ((title (read-string "Title: "))
         (slug (create-blog-post--slugify title))
         (directory (concat create-blog-post--directory slug)))
    (find-file (expand-file-name "index.org" directory))))
#+end_src

** Ekpor Teks ke Slack

Saya terkadang menulis notulensi rapat menggunakan org mode, karena saya perlu menyebarkannya ke kanal Slack, maka dari itu saya perlu /export backend/ untuk mengekspor dari org ke slack.

#+begin_src elisp :tangle ./packages.el
(package! ox-slack)
#+end_src

Doom emacs memiliki fungsi yang berguna untuk mengekspor teks yang dipilih ke /clipboard/, karena kita menginstal /export backend/ baru, kita perlu meregistrasikan benda tersebut ke dalam =org-export-backends=.

#+begin_src elisp :tangle ./config.el
(appendq! org-export-backends '(slack))
#+end_src

