index.org
** Ekpor Teks ke GFM

Merubah org menjadi GFM itu sangat berguna, karena terkadan saya menggunakan org untuk menulis README dan sebagainya.

#+begin_src elisp :tangle ./packages.el
(package! ox-gfm)
#+end_src

Doom emacs memiliki fungsi yang berguna untuk mengekspor teks yang dipilih ke /clipboard/, karena kita menginstal /export backend/ baru, kita perlu meregistrasikan benda tersebut ke dalam =org-export-backends=.

#+begin_src elisp :tangle ./config.el
(appendq! org-export-backends '(gfm))
#+end_src

* Pemrograman

Untuk pemrograman sendiri, saya tidak perlu melakukan konfigurasi yang rumit karena /doom emacs/ sendiri sudah mengabstraksi semuanya. Pada bagian ini, saya hanya akan menjabarkan terkait /tools/ yang saya gunakan dalam pemrograman di emacs, yaitu terminal, dan manajemen proyeknya.

** Ligature

Secara bawaan, ketika saya menginstal =ligatures +extra= di dalam UI, doom emacs akan memasang banyak /ligature/ di dalam bahasa pemrograman. Saya sendiri tidak terlalu senang dengan hal itu, maka dari itu lebih baik saya nonaktifkan saja dengan kode berikut:

#+begin_src elisp :tangle ./config.el
(setq +ligatures-extra-alist nil)
#+end_src

** Terminal

#+begin_src elisp :tangle ./config.el
(load-file (concat doom-user-dir "lisp/eshell/eshell.el"))
#+end_src

Untuk terminal sendiri saya menggunakan =eshell=. Terminal ini bisa saya katakan unik, karena terminal ini dapat mengevaluasi ekspresi elisp. Dan juga, terminal ini bisa dikatakan jauh lebih cepat dibandingkan shell dan term. Maka dari itu, menggunakan terminal ini adalah suatu opsi yang bijak.

#+begin_src elisp :tangle ./packages.el
(package! xterm-color)
#+end_src

Tentu saja, ada opsi lain yang tidak kalah bagus, yaitu =vterm=. Saya sendiri sudah menggunakan =vterm=. Namun saya ingin mencoba untuk menggunakan =eshell= sebagai terminal utama saya.

Konfigurasi terminal ini saya curi juga dari [[https://github.com/daviwil/dotfiles/blob/master/Emacs.org#eshell][Daviwil]].

#+begin_src elisp :tangle ./lisp/eshell/eshell.el
;;; $DOOMDIR/lisp/eshell/eshell.el -*- lexical-binding: t; -*-
(defun read-file (file-path)
  "Read file with temporary buffer."
  (with-temp-buffer
    (insert-file-contents file-path)
    (buffer-string)))

(defun +eshell-configure ()
  (evil-collection-eshell-setup)
  (push 'eshell-tramp eshell-modules-list)
  (push 'xterm-color-filter eshell-preoutput-filter-functions)
  (delq 'eshell-handle-ansi-color eshell-output-filter-functions)

  ;; Save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  (add-hook 'eshell-before-prompt-hook
            (lambda ()
              (setq xterm-color-preserve-properties t)))

  ;; Truncate buffer for performance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;; We want to use xterm-256color when running interactive commands
  ;; in eshell but not during other times when we might be launching
  ;; a shell command to gather its output.
  (add-hook 'eshell-pre-command-hook
            (lambda () (setenv "TERM" "xterm-256color")))
  (add-hook 'eshell-post-command-hook
            (lambda () (setenv "TERM" "dumb")))

  ;; Use completion-at-point to provide completions in eshell
  (define-key eshell-mode-map (kbd "<tab>") 'completion-at-point)

  ;; Initialize the shell history
  (eshell-hist-initialize)

  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'consult-history)
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
  (evil-normalize-keymaps)

  (setenv "PAGER" "cat")

  (setq eshell-prompt-function      '+eshell-prompt
        eshell-prompt-regexp        "^λ "
        eshell-history-size         10000
        eshell-buffer-maximum-lines 10000
        eshell-hist-ignoredups t
        eshell-highlight-prompt t
        eshell-scroll-to-bottom-on-input t
        eshell-prefer-lisp-functions nil))

(add-hook 'eshell-first-time-mode-hook #'+eshell-configure)
(setq eshell-directory-name "~/.cache/eshell/"
      eshell-aliases-file (expand-file-name "~/.cache/eshell/alias"))
#+end_src


/Prompt/ ini benar-benar saya curi dari Daviwil.

#+begin_src elisp :tangle ./lisp/eshell/eshell.el
(defun +eshell-prompt ()
  (let ((current-branch (magit-get-current-branch)))
    (concat
     "\n"
     (propertize (system-name) 'face `(:foreground ,(doom-color 'magenta)))
     (propertize " • " 'face `(:foreground ,(doom-color 'fg)))
     (propertize (+get-prompt-path) 'face `(:foreground ,(doom-color 'cyan)))
     (when current-branch
       (concat
        (propertize " • " 'face `(:foreground ,(doom-color 'fg)))
        (propertize (concat " " current-branch) 'face `(:foreground ,(doom-color 'red)))))
     (propertize " • " 'face `(:foreground ,(doom-color 'fg)))
     (propertize (format-time-string "%I:%M:%S %p") 'face `(:foreground ,(doom-color 'base4)))
     (if (= (user-uid) 0)
         (propertize "\n#" 'face `(:foreground ,(doom-color 'success)))
       (propertize "\nλ" 'face `(:foreground ,(doom-color 'success))))
     (propertize " " 'face `(:foreground ,(doom-color 'fg))))))
#+end_src

*** Prompt Path

Prompt ini berfungsi untuk menampilkan saya sekarang ada di mana di dalam terminal. Hanya nama direktori saja yang akan ditampilkan.

#+begin_src elisp :tangle ./lisp/eshell/eshell.el
(defun +get-prompt-path ()
  (let* ((current-path (eshell/pwd))
         (git-output (shell-command-to-string "git rev-parse --show-toplevel"))
         (has-path (not (string-match "^fatal" git-output))))
    (if (not has-path)
        (abbreviate-file-name current-path)
      (string-remove-prefix (file-name-directory git-output) current-path))))
#+end_src

*** Git Status Prompt

Prompt ini berguna untuk memberi tahu saya, saya sedang di /branch/ apa di dalam repository git. Namun ada kemungkinan saya akan nonaktifkan fitur ini dikarenakan ada beberapa repository yang benar-benar berat untuk dimuat.

#+begin_src elisp :tangle ./lisp/eshell/eshell.el
(defun +map-line-to-status-char (line)
  (cond ((string-match "^?\\? " line) "?")))

(defun +get-git-status-prompt ()
  (let ((status-lines (cdr (process-lines "git" "status" "--porcelain" "-b"))))
    (seq-uniq (seq-filter 'identity (mapcar '+map-line-to-status-char status-lines)))))
#+end_src

** Protobuf

#+begin_src elisp :tangle ./packages.el
(package! protobuf-mode)
#+end_src

** Projectile

/Projectile/ adalah sebuah /package/ yang membantu saya untuk berpindah-pindah proyek di dalam emacs. Disini saya hanya perlu memberitahu dimana direktori proyek saya.

#+begin_src elisp :tangle ./config.el
(use-package! projectile
  :init
  (when (and (file-directory-p "~/Works/Repositories") (file-directory-p "~/Repositories"))
    (setq projectile-project-search-path '("~/Work/Repositories" "~/Repositories" "~/Repositories/GO/src"))))
#+end_src

** Ripgrep

Ripgrep adalah sebuah biner yang berfungsi layaknya /grep/, bedanya /ripgrep/ jauh lebih cepat karena ditulis menggunakan /rust/. Dan juga, /ripgrep/ ini sudah terintegrasi dengan projectile.

#+begin_src elisp :tangle ./packages.el
(package! ripgrep)
#+end_src

** Guile

#+begin_src elisp :tangle ./config.el
(setq geiser-repl-autodoc-p nil
      geiser-mode-autodoc-p nil)
#+end_src
