config.el

(appendq! org-export-backends '(gfm))

(setq +ligatures-extra-alist nil)

(load-file (concat doom-user-dir "lisp/eshell/eshell.el"))

(use-package! projectile
  :init
  (when (and (file-directory-p "~/Works/Repositories") (file-directory-p "~/Repositories"))
    (setq projectile-project-search-path '("~/Work/Repositories" "~/Repositories" "~/Repositories/GO/src"))))

(setq geiser-repl-autodoc-p nil
      geiser-mode-autodoc-p nil)
